{"name":"National Personal Insolvency Index Search","configuration":"\{\n    \"description\":\"Search the National Personal Insolvency Index to see if a debtor is currently, or has been, subject to the Bankruptcy ACT 1966\"\n\}","subpages":[{"title":"Getting Started","markdown":"The National Personal Insolvency Index is a permanent electronic register of personal insolvency proceedings in Australia maintained and updated by the Australian Financial Security Authority.\n\nKnown as the NPII, it contains records from August 1928.\n\nThe purpose of the NPII is to provide publicly available information regarding the insolvency status of individuals. For a fee, anyone may conduct a search of the NPII to determine whether a debtor is currently, or has previously been, subject to provisions of the Bankruptcy Act 1966.\n\n\nThe NPII contains details of:\n- Creditors Petitions\n- Debt Agreements\n- Personal Insolvency Agreements\n- Bankruptcies\n- Insolvent Deceased Estates\n- Control Orders and Authorities\n\nThe information available includes:\n\n - The name, date of birth (if known), address (suburb/state) and occupation of the person as disclosed on documents accepted by AFSA when the proceeding started\n- Previous names and aliases if known\n- The type of proceeding, the date it started and the administration number\n- The name and business address of the trustee or administrator of the proceeding\n- The current status of the person and/or the proceeding (e.g. whether a person is discharged from bankruptcy or whether a Creditors Petition for a person’s bankruptcy is in progress).","subpages":[{"title":"Key Information","markdown":"The NPII service is accessible using SOAP and uses XML for the message payload."},{"title":"Fees","markdown":"The fees charged for NPII Search usage are [here](https://www.afsa.gov.au/insolvency/how-we-can-help/fees-and-charges-0#service-fees).\n\n\nAn organisation must become an ‘On Account’ customer with AFSA in order for usage of the service to be billed to the organisation accessing the service.  The organisation must additionally complete the B2G channel [registration process](https://www.afsa.gov.au/online-services/b2g-system-integration/afsa-b2g-registration-steps)."}]},{"title":"Authentication","markdown":"A device AUSkey is required for authentication of NPII Search operation requests, see the [AFSA Web Services Gateway Guide](https://www.afsa.gov.au/sites/g/files/net1601/f/itsa-web-service-gateway-guide.pdf) for more information."},{"title":"Using the API","markdown":"The operations in this service are described in the [NPII Search MIG](https://www.afsa.gov.au/sites/g/files/net1601/f/mig-npiisearch_v1.4.20150429.pdf) on the AFSA website."}]}