{"name":"Debt Agreements Service","configuration":"\{\n    \"description\":\"A service that allows practitioners to propose a debt agreement, and any subsequent variations and/or terminations to the agreement. Creditors can submit claim and votes on these proposals\"\n\}","subpages":[{"title":"Getting Started","markdown":"Debt agreements is a SOAP/XML web service allows practitioners to propose a debt agreement (DA), and any subsequent variations and/or termination to the agreement.  This service allows creditors to vote on these proposals and additionally allows both practitioners and creditors to retrieve relevant correspondence."},{"title":"Business Context","markdown":"A debt agreement (DA) is an option to assist debtors with unmanageable debt.  The DA is a legally binding agreement between a debtor and their creditors where creditors agree to accept a sum of money that the debtor can afford.  The debtor is released from their debts when they complete all payments and obligations under the agreement.  Creditors vote on whether to accept or reject a DA proposal.\n\n"},{"title":"Operations","markdown":"- SearchCreditors\n- GetCreditor\n- CreateCreditor\n- GetDocuments\n- SubmitDebtAgreementProposal\n- SearchCorrespondence\n- GetCorrespondence\n- SubmitDebtAgreementVariation\n- SubmitDebtAgreementTermination\n- SubmitDebtAgreementCompletion\n- SubmitDebtAgreementDefault\n\nThe business processes and operations are further described in the [Debt Agreements Service Practitioners MIG](/artefacts/MIG-DAServicePractitioners_v1.2.pdf)\n \n\n## Operations for Creditors\n- SearchCorrespondence\n- GetCorrespondence\n- GetDebtAgreementProposalCreditor\n- SubmitDebtAgreementClaimAndVote\n- GetDocuments\n\nThe Debt Agreements Service Creditors MIG is coming soon"},{"title":"Fees","markdown":"For practitioners there is a [fee](https://www.afsa.gov.au/insolvency/how-we-can-help/fees-and-charges-0) for proposing a DA, but not for lodgement of subsequent DA forms or retrieval of correspondence.\n\n \n\nFor creditors, no fees apply to using this any operations in this service."},{"title":"Authentication","markdown":"A device AUSkey is required for authentication of DA Service operation requests, see the [AFSA Web Services Gateway Guide](https://www.afsa.gov.au/sites/g/files/net1601/f/itsa-web-service-gateway-guide.pdf) for more information."}]}