{"name":"Individual Income Tax Returns","configuration":"\{\n    \"description\":\"Lodge the tax return of an individual with the Australian Taxation Office\"\n\}","subpages":[{"title":"This is a prototype","markdown":"While every effort has been made to ensure the information provided here is correct, it is a prototype developed so we can get your feedback on a new way of documenting our services.\n\nYou should reffer to [the original documentation](http://www.sbr.gov.au/__data/assets/file/0010/46738/ATO-IITR-2018-Package-v0.3.zip) for if you are considering implementing this service.\n\n## Telling us what you think\nWe would love to hear what you think about both the new style of documentation, and the service catalogue platform.\n\nIf you would like to give us feedback, please [raise a github issue](https://github.com/dxa/service-catalogue/issues/new)"},{"title":"Getting started","markdown":"The information provided in a tax return allows the ATO to work out a taxpayer’s tax refund or tax debt.\n\nTax returns usually cover the financial year, which ends on 30 June and are due by 31 October.  A registered tax agent can usually lodge later than this, but a taxpayer needs to register with them as a client before 31 October to qualify.\n\nMost people need to lodge a tax return each year, but there are some exceptions.  For more information on whether a taxpayer needs to lodge a tax return, please see the [ATO website](https://www.ato.gov.au/Individuals/Lodging-your-tax-return/Do-you-need-to-lodge-a-tax-return-/).\n\n**Note:** Sole traders are *not* able to self-lodge through SBR, and must engage the services of a registered tax agent or use one of the ATO’s self-preparer options such as myTax."},{"title":"Things you should know","markdown":"","subpages":[{"title":"Key information","markdown":"These services are offered as by the Australian Taxation Office.\n\n## Key dates\n\nTax returns ususally cover the financial year, which ends on June 30.\n\nTax returns are due 123 days later, on October 31."},{"title":"Standard Business Reporting","markdown":"Standard Business Reporting is a joint initiative between serveral federal and state government agenceis to simplify and standardise the way they offer their machine-to-machine services.\n\n> More information about what SBR is and the major components\n"}]},{"title":"Using these services","markdown":"","subpages":[{"title":"Things you can use","markdown":"- SDKs\n- Downloads\n- etc"},{"title":"What we need from you","markdown":"","subpages":[{"title":"Registering for access","markdown":"The ATO has implemented a compliance framework for Digital Service Providers, called the Operational Framework. The framework ensures the safety and integrity of the taxation and superannuation systems for all Australians.\n\nAn important step in registering for access is demonstrating how your products, and your business, meet the framework.\n\n> More information on the operational framework, complying with it, and timeframes\n\n> More information on registering \n"},{"title":"Taxpayer declarations","markdown":"If you are lodging on behalf of a taxpayer, the law requires you to obtain a declaration from them first.\n\nThere are legal requirements on retaining declarations. You should [read the ATO article on taxpayer declarations](https://www.ato.gov.au/tax-professionals/prepare-and-lodge/managing-your-lodgment-program/client-declarations-and-lodgment-online/#Answerstofrequentlyaskedquestions) if you are unsure.\n\n\nHere is our suggested wording of a declaration\n> **Privacy**\n> The ATO is authorised by the *Taxation Administration Act 1953* to request the provision of tax file numbers (TFNs). The ATO will use the TFNs to identify you in our records. It is not an offence to not provide the TFNs. However, lodgements cannot be accepted electronically if the TFN is not quoted.\n>\n> Taxation law authorises the ATO to collect information and to disclose it to other government agencies. For information about your privacy go to [ato.gov.au/privacy](http://ato.gov.au/privacy)\n>\n> **Declaration**\n>\n> I declare that:\n> - All of the information I have provided to the agent for the preparation of this document is true and correct\n> - I authorise the agent to give this document to the Commissioner of Taxation."}]},{"title":"Security","markdown":"> Information on AUSKey, including cut off dates + sdks\n> Information on AUSID + sdks"},{"title":"Matching client information to ATO records","markdown":"We match taxpayers using their surname and date of birth.\n\nThese values must be the same as stored in ATO systems or the lodgment will be rejected and error message returned to the user.  \n\nChanges of demographic, address and contact information on amendments are not advised as this will cause processing of the amendment to cease. \n\nATO systems will not inform the user during processing when the amendment data differs from client records but will indicate via SBR that the amendment has been accepted successfully.\n\nThe demographic, contact and address information will then be validated manually by an ATO officer (including contacting the tax agent) before the processing of the amendment can continue.\n\nConsider if you should let your users modify any of these fields:\n\n| Report Label | SBR Alias | ELS tag  | \n| --- | --- | --- |\n| Year of return | IITR10 | ABB | \n| Tax file number | IITR15 | AAD | \n| Title | IITR21 | ABE | \n| Family name | IITR22 | ABF | \n| Suffix | IITR23 | BAW | \n| First name | IITR24 | ABG | \n| Other given names | IITR25 | BBB | \n| Has name or title changed since last tax return lodged | IITR26 | BFG | \n| Current postal address - Address line 1 | IITR33 | ABH | \n| Current postal address - Address line 2 | IITR34 |  | \n| Current postal address - Suburb/Town | IITR35 | AME | \n| Current postal address - State | IITR36 | AMF | \n| Current postal address - Postcode | IITR37 | APE | \n| Current postal address - Country code | IITR38 | KGD | \n| Postal address changed | IITR39 | BFH | \n| Home address - Address line 1 | IITR41 | ABK | \n| Home address - Address line 2 | IITR42 |  | \n| Home address - Suburb/Town | IITR43 | AXQ | \n| Home address - State | IITR44 | AXR | \n| Home address - Postcode | IITR45 | APH | \n| Home address - Country code | IITR52 | KGE | \n| Date of birth | IITR29 | ABQ | \n| Date of death | IITR28 | ARH | \n| Your mobile phone number | IITR48 | KGR | \n| Daytime phone area code | IITR49 | BOC | \n| Daytime phone number | IITR50 | BOD | \n| Contact E-mail address | IITR51 | FLW |  \n"}]},{"title":"Technologies used","markdown":"","subpages":[{"title":"Representing data - XBRL","markdown":"eXtensible Business Reporting Language is the technology used by Standard Business Reporting to represent the data that is exchanged between parties.\n\n> More information about what XBRL is, how it works, and implementation options\n"},{"title":"Sending messages - ebMS3","markdown":"The Australian Taxation Office use a messaging technology called [ebMS3](http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/core/cs02/ebms_core-3.0-spec-cs-02.html), part of the [Electronic Business using eXtensible Markup Language](https://en.wikipedia.org/wiki/EbXML) OASIS standard.\n\n> More information about what ebMS3 is, how it works, and implementation options\n"}]},{"title":"Individual Income Tax Return","markdown":""},{"title":"Capital Gains Tax Schedule","markdown":""},{"title":"Dividends and Interest Deductions Schedule","markdown":""},{"title":"Non-Resident Foreign Income Schedule","markdown":""},{"title":"Payment Summary Schedule","markdown":""},{"title":"Rental Schedule","markdown":""},{"title":"Work Related Expenses Schedule","markdown":""}]}